app/controllers/tarefas_controller.rb

INSERT INTO "tarefas" ("nome", "descricao", "usuario_id", "created_at", "updated_at", "finalizada") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Teste"], ["descricao", "Teste"], ["usuario_id", 1], ["created_at", "2022-01-09 15:33:34.339122"], ["updated_at", "2022-01-09 15:33:34.339122"], ["finalizada", nil]]
---
    def create
        @tarefa = @usuario.tarefas.create(tarefa_params)

SELECT "tarefas".* FROM "tarefas" WHERE "tarefas"."usuario_id" = ? AND "tarefas"."id" = ? LIMIT ?  [["usuario_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "tarefas" SET "nome" = ?, "descricao" = ?, "updated_at" = ? WHERE "tarefas"."id" = ?  [["nome", "aaa"], ["descricao", "aaa"], ["updated_at", "2022-01-09 20:32:32.093909"], ["id", 12]]
---
    def update
        @tarefa = @usuario.tarefas.find(params[:id])
        if @tarefa.update(tarefa_params)

SELECT "tarefas".* FROM "tarefas" WHERE "tarefas"."usuario_id" = ? AND "tarefas"."id" = ? LIMIT ?  [["usuario_id", 21], ["id", 4], ["LIMIT", 1]]
DELETE FROM "tarefas" WHERE "tarefas"."id" = ?  [["id", 4]]
---
    def destroy
        @tarefa = @usuario.tarefas.find(params[:id])
        if @tarefa.destroy

UPDATE "tarefas" SET "updated_at" = ?, "finalizada" = ? WHERE "tarefas"."id" = ?  [["updated_at", "2022-01-09 21:02:39.368006"], ["finalizada", 0], ["id", 17]]
UPDATE "tarefas" SET "updated_at" = ?, "finalizada" = ? WHERE "tarefas"."id" = ?  [["updated_at", "2022-01-09 21:02:06.683859"], ["finalizada", 1], ["id", 17]]
---
    def finalizada
        if @tarefa.finalizada
            @tarefa.update_attribute(:finalizada, false)
            redirect_to @usuario, notice: "A tarefa não foi finalizada"
        else
            @tarefa.update_attribute(:finalizada, true)

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
---
    def set_usuario
        @usuario = Usuario.find(params[:usuario_id])

SELECT "tarefas".* FROM "tarefas" WHERE "tarefas"."usuario_id" = ? AND "tarefas"."id" = ? LIMIT ?  [["usuario_id", 27], ["id", 15], ["LIMIT", 1]]
---
    def set_tarefa
        @tarefa = @usuario.tarefas.find(params[:id])