app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("email", "senha", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "meap@cin.ufpe.br"], ["senha", "006Matth"], ["created_at", "2022-01-09 14:45:50.041478"], ["updated_at", "2022-01-09 14:45:50.041478"]]

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "email" = ?, "senha" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["email", "meap@cin.ufpe.brrrasd"], ["senha", "asdasdasdas"], ["updated_at", "2022-01-09 19:14:38.599781"], ["id", 22]]